Revit 2027 API
IFCLegacyStairOrRamp.RiserHeight Property
 The height of riser.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RiserHeight { get; }
Public ReadOnly Property RiserHeight As Double
	Get
public:
property double RiserHeight {
	double get ();
}
member RiserHeight : float with get
Property Value
Double
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace